app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)

  def create
    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("name", "created_at", "updated_at", "file_name") VALUES('doc1', '2011-03-09 01:12:22', '2011-03-09 01:12:22', 'file1')