app/controllers/surveys_controller.rb

SELECT * FROM "surveys"
---
  def index
    @surveys = Survey.all

SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def show
    @survey = Survey.find(params[:id])

SELECT * FROM "surveys" WHERE ("surveys"."id" = 2)
---
  def edit
    @survey = Survey.find(params[:id])

INSERT INTO "surveys" ("name", "created_at", "updated_at") VALUES('Survey 1', '2011-03-10 10:06:41', '2011-03-10 10:06:41')
---
  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save