app/controllers/toasts_controller.rb

  def index
    @toasts = Toast.all
---
SELECT * FROM "toasts"

  def show
    @toast = Toast.find(params[:id])
---
SELECT * FROM "toasts" WHERE ("toasts"."id" = 1)

  def create
    @toast = Toast.new
    @toast.bread = params[:toast][:bread]

    puts "Original File Name " +  params[:toast][:photo].original_filename.to_s

    # target directory to save files
    directory = "public/images/"

    # create the file path
    path = File.join(directory, params[:toast][:photo].original_filename.to_s)

    # write the file
    File.open(path, "wb") { |f| f.write(params[:toast][:photo].read) }

    if @toast.save
---
INSERT INTO "toasts" ("created_at", "updated_at", "bread") VALUES('2011-03-02 22:36:54', '2011-03-02 22:36:54', '123')

  def destroy
    @toast = Toast.find(params[:id])
    @toast.destroy
---
SELECT * FROM "toasts" WHERE ("toasts"."id" = 1)
DELETE FROM "toasts" WHERE "id" = 1